{
  "404": {
    "error": "The webmaster said that you can not enter this page...",
    "check": "Please check that the URL you entered is correct, or click the button below to return to the homepage.",
    "back": "Back to home"
  },
  "500": {
    "msg": "Ops！Server error"
  },
  "index": {
    "online": "Online",
    "sponsorContent": [
      "The operation of this website requires renting servers, domain names, etc., which is the largest expense (A server with the minimum configuration will cost about 100 dollars one year).",
      "This website has been running by myself, I hope SR's ecosystem is getting better, and there is still a lot of <a href='https://github.com/users/TinyMaD/projects/1/views/1' target='_blank'>Todo</a> about this website.",
      "If you want to support this website, you can click the link button below to sponsor me (Afdian's sponsorship will be displayed in real time above, and Paypal's will be displayed within 24 hours)"
    ],
    "sponsorTitle": "Thanks to {0} sponsors",
    "addedChartTitle": "Increased Score Past Two Weeks",
    "hourChartTile": "Playtime Past Two Weeks",
    "hourChartUnit": "hrs"
  },
  "layout": {
    "login": "Login",
    "logout": "Logout",
    "logoutSucc": "Logout successful",
    "email": "Click to copy email address",
    "copyEmail": "Copied to clipboard"
  },
  "routes": {
    "home": "Home",
    "match": "Match",
    "rank": "Rank",
    "mod": "MOD",
    "searchplayer": "Stats",
    "plaza": "Discover",
    "log": "Change Log",
    "privacy": "Privacy Settings"
  },
  "mod": {
    "upload": "Upload",
    "yourStar": "Your stars",
    "trail": "Trails",
    "character": "Characters",
    "item": "Items",
    "sound": "Sounds",
    "bg": "Background",
    "other": "Others",
    "uploadingTitle": "Uploading, please wait patiently...{0} %",
    "loadTitle": "Upload MOD resources",
    "uploadCover": "Click to upload cover",
    "uploadFile": "Click to upload file",
    "loadSucc": "Upload successful",
    "inputTitle": "Please enter a title",
    "lengthWarn": "The number of characters cannot be greater than 17",
    "loadCoverPlz": "Please upload the cover",
    "bigImgWarn": "Image size cannot exceed 5 MB",
    "mustImg": "The file must be image",
    "uploadFilePlz": "Please upload file",
    "bigFileWarn": "File size cannot exceed 20 MB",
    "invalidWarn": "Invalid SteamID or vanity URL, please select the player you want to query",
    "download": "Download",
    "starSucc": "Starred successful",
    "unstarSucc": "Unstar",
    "star": "Starred",
    "unStar": "Star",
    "deleteSucc": "Deleted MOD successfully",
    "deleteWarn": "Delete This Mod ?\t",
    "deleteInfo": "Once you delete a mod, there is no going back. Please be certain."
  },
  "common": {
    "search": "Search",
    "keywords": "Please enter name keyword",
    "loginPlz": "Please log in first",
    "type": "Type",
    "selectType": "Please select the type",
    "title": "Title",
    "submit": "Submit",
    "cancel": "Cancel",
    "notice": "Notice",
    "success": "Successful",
    "delete": "Delete",
    "confirm": "Confirm"
  },
  "rank": {
    "personaName": "Name",
    "tier": "League",
    "score": "Rank score",
    "updateInfo": "*Data update frequency: every 10 mins",
    "diamond": "Diamond",
    "platinum": "Platinum",
    "gold": "Gold",
    "silver": "Silver",
    "bronze": "Bronze",
    "expert": "Expert",
    "advanced": "Advanced",
    "beginner": "Beginner",
    "entry": "Entry",
    "playTime": "Total playtime",
    "past2weeks": "Playtime past 2 weeks"
  },
  "stats": {
    "enterSteamID": "Please enter SteamID, vanity URL or name",
    "content": "Query the SpeedRunners stats of Steam user, query speed: SteamID (stable) > Vanity URL (stable) > name (unstable)",
    "showMore": "{0} results left—Click to show more—",
    "noResult": "No relevant results were found. The player may not have set the Steam profile-privacy to public."
  },
  "match": {
    "prizePool": "Total Prize Pool",
    "schedule": "Schedule[Archived]",
    "participant": "Participant",
    "points": "Points",
    "reward": "Reward",
    "badgeContent": "The top 10 players will receive achievement badge (only displayed on this site):",
    "support": "Support",
    "sponsor": "Sponsor",
    "amount": "Amount",
    "sponsorship": "Sponsorship method (scan the QR code below):",
    "contactMe": "For other sponsorship methods, please contact me (email) {0}",
    "time": "Match Time",
    "groupStage": "Group stage",
    "finalStage": "Final stage",
    "sponsorContent": [
      "Thanks to all the sponsors, no matter the amount, because of your support, this event can be held ",
      "The prize money of this event is all sponsored by the sponsors, and 100% of the funds sponsored by the sponsors will enter the total prize pool ",
      "In order to ensure that the sponsorship is open and transparent, please note your ID (unique, you could discern) when sponsoring. No remarks will be recorded as anonymous. I will maintain the sponsor list within 24 hours after receiving the sponsor, if you do not find your ID in the list, you can go to the QQ group (319422487) for feedback ",
      "Sponsor list:"
    ],
    "matchContent": [
      {
        "title": "Qualification",
        "content": [
          "Chinese communication barrier-free, players with low network latency to referees are eligible to sign up",
          "The top 12 players in the \"Points\" ranking will qualify for the competition",
          "\"Points\" = \"Rank score\" + \"Playtime Score\"",
          "\"Rank score\": Total score obtained from ranked matches",
          "\"Playtime Score\" = \"Effective Playtime\" X 10. Note: Game time refers to the playtime of SpeedRunners, in hours. Please  set your Steam privacy settings to public",
          "\"Effective Playtime\" = Total Playtime - playtime in the last two weeks. Note: If \"Effective Playtime\" exceeds 1000   hours, it will be calculated as 1000 hours. \"Last two weeks\" refers to the two weeks before the registration deadline,  regardless of the registration time",
          "Example: Tom has 10000 Rank score, play speedrunners for 1200 hours, and has play 300 hours in the last two weeks. His points is calculated as 10000 + (1200 - 300) X 10 = 19000",
          "The top 4 players in the \"Points\" ranking will directly secure 4 spots in the winner's group of 8",
          "The remaining 8 players in the \"Points\" ranking will enter the group stage"
        ]
      },
      {
        "title": "Group Stage",
        "content": [
          "Format: Round-robin 1v1 (each player will compete against the other 7 players)",
          "Number of matches: 3",
          "Maps: Random official maps and workshop maps",
          "B/P: No map banning, directly click the random official map and random workshop map buttons in the bottom right   corner of the official map selection screen (alternating between workshop maps and official maps)",
          "Scoring: Points and wins (after scoring by points, players with the same score will be ranked by number of wins)",
          "The top 4 players in the group stage will enter the winner's group",
          "The bottom 4 players in the group stage will enter the loser's group"
        ]
      },
      {
        "title": "Final Stage",
        "content": [
          "Format: Double elimination, strong vs. strong matchups",
          "Number of matches: Winner's group semifinals, loser's group finals, grand finals (bo15), and other matches (bo11)",
          "Maps: To be determined",
          "B/P: To be determined",
          "Warm-up matches: Before the winner's group semifinals, loser's group finals, and grand finals, two warm-up matches will be   played. The results of the warm-up matches will not affect the competition results. One random official map and one random  workshop map will be used"
        ]
      },
      {
        "title": "Other Information",
        "content": [
          "Please join the SpeedRunners competition QQ group: 743740882",
          "Work in progress, please continue to stay tuned...",
          "※The final interpretation right belongs to this website"
        ]
      }
    ],
    "prize": "Prize (varies with total prize pool)",
    "additional": "Extra bonus",
    "standings": "No. {0}",
    "algorithm": [
      "Bonus Algorithm:",
      "For each rank increase, the bonus doubles, with a maximum difference of 500 yuan",
      "The calculated value is rounded down, and the sum of the discarded amounts is added to the lowest rank bonus",
      "Among the participants who do not have a fixed bonus rank, there is a chance to roll for a 50 yuan bonus",
      "Additional bonuses are distributed according to custom rules set by sponsors and are not included in the algorithm calculation"
    ]
  },
  "components": {
    "cropper": {
      "title": "The cover should show more details of the MOD",
      "crop": "Crop"
    }
  },
  "login": {
    "loginSuccess": "Login successful, automatically return to homepage after {0} seconds",
    "logging": "Logging in, please wait patiently...",
    "validating": "Verifying login information...",
    "validateSucc": "Login information verified successfully",
    "initData": "Initialize user data",
    "initing": "Initializing user data...",
    "initSucc": "Initialize user data successfully"
  },
  "privacy": {
    "publishState": "Publish Steam State",
    "publishStateDetail": "Everyone can see your Steam state and if you are playing SR",
    "publishPlaytime": "Publish the recent playtime of SR",
    "publishPlaytimeDetail": "Displayed in \"Playtime past 2 weeks\" on the homepage",
    "allowGetRankScore": "Allow this website to request your rank score of SR",
    "allowGetRankScoreDetail": "It also includes the following elements witch you can control individually :",
    "publishAddScore": "Publish increased score of SR",
    "publishAddScoreDetail": "Displayed in \"Increased score past 2 weeks\" on the homepage ",
    "publishTotalScore": "Publish total rank score of SR",
    "publishTotalScoreDetail": "Displayed in the list of rank page"
  }
}
